import 'package:aljazera/HomeVeiw/Sports/Ditiles.dart';
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

class Football1 extends StatelessWidget{
  @override
  Widget build(BuildContext context) {
    // TODO: implement build
    return Scaffold(

      appBar: AppBar(  backgroundColor: Colors.blue),

      body: Padding(
        padding: const EdgeInsets.all(8.0),
        child: SingleChildScrollView(
          child: Column(
          
            children: [


              NewsSport(
                context,
                title: "ألمانيا تتقدم على المجر بهدف نظيف في الشوط الأول",
                describ: "- انتهت أحداث الشوط الأول"
                    " بتقدم منتخب ألمانيا ضد نظيره منتخب ا"
                    "لمجر، بهدف نظيفبتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضدد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخب نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ، "
                    "ضمن منافسات الجولة الأولى "
                    "من بطولة دوري الأمم الأوروب27 من عمر الشوط الأول",
                imagpath: "images/f.jpg",
              ),
              NewsSport(
                context,
                title: "ألمانيا تتقدم على المجر بهدف نظيف في الشوط الأول",
                describ: "- انتهت أحداث الشوط الأول"
                    " بتقدم منتخب ألمانيا ضد نظيره منتخب ا"
                    "ضمن منافسات الجولة الأولى "
                    "من بطولة دوري الأمم الأوروب27 من عمر الشوط الأول",
                imagpath: "images/kooora.jpg",
              ),
              NewsSport(
                context,
                title: "ألمانيا تتقدم على المجر بهدف نظيف في الشوط الأول",
                describ: "- انتهت أحداث الشوط الأول"
                    " بتقدم منتخب ألمانيا ضد نظيره منتخب ا"
                    "لمجر، بهدف نظيفبتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخببتقدم منتخب ألمانيا ضدد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخبد نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخب نظيره منتخببتقدم منتخب ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ألمانيا ضد نظيره منتخب ، على ملعب اسبرت أرينا ، "
                    "ضمن منافسات الجولة الأولى "
                    "من بطولة دوري الأمم الأوروب27 من عمر الشوط الأول",
                imagpath: "images/kora.jpg",
              ),

          
            ],
          
          ),
        ),
      ),

    );
  }

}

Widget NewsSport(BuildContext context,{ required String title, required String describ, required imagpath}){
  return  InkWell(

    onTap: (){

      Navigator.push(context, MaterialPageRoute(builder: (context)=> Ditiles(
        title1: title,
        description1: describ,
        imagePath1: imagpath,

      )));
    },


    child: Container(
      height: 300,
      width: double.infinity,
      child: Column(
        children: [
          Container(
            width: double.infinity,
            height: 200,
            decoration: BoxDecoration(

                borderRadius: BorderRadius.circular(30),
                image: DecorationImage(
                  fit: BoxFit.cover,
                  image: AssetImage(imagpath),
                )
            ),


          ),
          ListTile(

            title: Text(title,overflow: TextOverflow.ellipsis, textDirection: TextDirection.rtl,style: TextStyle(fontWeight: FontWeight.bold),) ,

            subtitle: Text(describ,maxLines: 2,
              overflow: TextOverflow.ellipsis,
              textDirection: TextDirection.rtl,
              style: TextStyle(fontSize: 15),) ,
          )


        ],
      ),
    ),
  );
}